In [2]:
# <h2>Soal 1: Pivoting and Melting</h2>

# Jelaskan itu pivoting dan melting data
Pivoting adalah suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi di column.
Melting adalah ‘unpivoting’, melting mengubah suatu data dengan memutar dari yang tadinya berada di posisi column menjadi di posisi row.

In [3]:
# <h2>Soal 2: Data structure Comprehension</h2>

# Data yang rapi adalah:
# 1. Setiap row menunjukan suatu unit observasi
# 2. Setiap column merupakan suatu unit variable

# Bagaimana pun, dalam menentukan unit observasi itu tergantung dari kasus yang di hadapi. sebagai seorang data scientist pasti akan menemukan berbagai bentuk struktur data. adalah sangat penting bagi seorang data scientist untuk dapat memahami dan menjelaskan setiap struktur data. Kemampuan memahami hubungan antara index baris, column dan isi data adalah kunci untuk memahami informasi apa yang data sedang beritahukan kepada kita.

# Di bawah ini terdapat 2 data yang berisi sama, tetapi memiliki struktur yang berbeda. Jelaskan perbedaan dari 2 struktur data tersebut
# jawaban 
pada gambar yang pertama Data structure Comprehension menggunakan pivot dengan index='Tipe Ujian' sedangkan colomns='Mata Pelajaran' dengan  Values ='Rata2 Waktu Belajar (menit)' 
dapat di ketahui bahwa pada gambar pertama menggunakan method pivot karena terdapat argumen di dalamnya di anataranya index,colomns dan values

Pada gambar kedua Data structure Comprehension menggunakan melt dengan id_vars='Hari',var_name='Mata Pelajaran', value_name='Rata2 Waktu Belajar(menit)', 
dapat di ketahui bahwa pada gambar kedua menggunakan method melt karena terdapat argument id_vars dan Value_var

In [45]:
# <h2>Soal 3: Reshaping Data 1</h2>
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}
df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          588                 57
1        UAS1         Fisika                          221                 48
2        UTS2         Fisika                          716                 60
3        UAS2         Fisika                          264                 44
4        UTS1     Matematika                          201                 97
5        UAS1     Matematika                          224                 96
6        UTS2     Matematika                          442                 68
7        UAS2     Matematika                          419                 72
8        UTS1     Statistika                          599                 46
9        UAS1     Statistika                          358                 99
10       UTS2     Statistika                          452                 66
11       UAS2     Statistika                          682                 82

In [50]:
df_pivot=pd.pivot(df, index='Tipe Ujian',columns='Mata Pelajaran', values=['Rata2 Nilai Ujian','Rata2 Waktu Belajar (menit)'])
df_pivot

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          48         96         99
UAS2                          44         72         82
UTS1                          57         97         46
UTS2                          60         68         66

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   221        224        358
UAS2                                   264        419        682
UTS1                                   588        201        599
UTS2                                   716        442        452

In [24]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df2 = pd.DataFrame(data).set_index('Hari')
df2
# diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

In [35]:

df2_melt=pd.melt(df2.reset_index(),id_vars='Hari',var_name='Tempat Hiburan', value_name='Pengunjung' )
df2_melt

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

In [36]:
import pandas as pd

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1']*3,
    'Mata Pelajaran' :['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta' : [14, 17, 12, 16, 14, 13]
}
df3 = pd.DataFrame(data).set_index('Tipe Ujian')
df3

           Mata Pelajaran  Jumlah Peserta
Tipe Ujian
UTS1           Statistika              14
UAS1               Fisika              17
UTS1               Fisika              12
UAS1           Statistika              16
UTS1               Fisika              14
UAS1           Statistika              13

In [38]:
# Perhatikan bahwa data jumlah peserta ujian untuk suatu tipe ujian dan mata pelajaran tertentu ada yang duplikat, ubahlah struktur data tersebut dan lakukan aggregasi berjenis jumlah sehingga sesuai dengan hasil yang di harapkan

df3_pivot=pd.pivot_table(df3.reset_index(),index='Tipe Ujian',columns='Mata Pelajaran',values='Jumlah Peserta',aggfunc='sum')
df3_pivot

Mata Pelajaran  Fisika  Statistika
Tipe Ujian
UAS1                17          29
UTS1                26          14